Store/src/AccumulationRegisters/ТоварыНаСкладе/ТоварыНаСкладе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыНаСкладе</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Store/src/AccumulationRegisters/ТоварыНаСкладе/ManagerModule.bsl
// функция возвращает остаток товара по переданной номенклатуре в виде соответствия, где ключ Склад и значение - количество
// возвращаемое значение - соответствие
// Пример использования:
// ОстатокТовара = РегистрыНакопления.ТоварыНаСкладе.ПолучитьОстатокТовара(Номенклатура);
//
// параметры:
// Номенклатура - ссылка на номенклатуру, по которой нужно получить остаток
//
// возвращаемое значение:
// соответствие, где ключ - Склад, значение - количество
//
//

```1c
Функция ПолучитьОстатокТовара(Номенклатура, Склады) Экспорт

	ОстатокТовара = Новый Соответствие;
	Для каждого Склад Из Склады цикл
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладе.Склад КАК Склад,
		|	ТоварыНаСкладе.Количество КАК Количество
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладе.Остатки(, Номенклатура = &Номенклатура) КАК ТоварыНаСкладе
		|ГДЕ
		|	ТоварыНаСкладе.Номенклатура = &Номенклатура
		|	И ТоварыНаСкладе.Склад = &Склад";
	
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("Склад", Склад);
	
		РезультатЗапроса = Запрос.Выполнить();
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОстатокТовара.Вставить(ВыборкаДетальныеЗаписи.Склад, ВыборкаДетальныеЗаписи.Количество);
		КонецЦикла;
	КонецЦикла;
	
	Возврат ОстатокТовара;

КонецФункции
```
